jfy9606/xiaozhi-esp32/main/boards/common/board.cc
#include "board.h"
#include "system_info.h"
#include "settings.h"
#include "display/display.h"
#include "display/oled_display.h"
#include "assets/lang_config.h"

#include <esp_log.h>
#include <esp_ota_ops.h>
#include <esp_chip_info.h>
#include <esp_random.h>
#include <driver/i2c_master.h>
#include <cstdlib>

#define TAG "Board"

// 静态变量初始化
board_config_t Board::board_config_ = {0};
bool Board::config_initialized_ = false;

namespace iot {

board_config_t* board_get_config() {
    return Board::GetBoardConfig();
}

} // namespace iot

// 全局C函数，用于获取I2C总线句柄
extern "C" i2c_master_bus_handle_t board_get_i2c_bus_handle(void) {
    return Board::GetInstance().GetDisplayI2CBusHandle();
}

// 全局C函数，用于获取板级配置
extern "C" board_config_t* board_get_config(void) {
    return Board::GetBoardConfig();
}

Board::Board() {
    Settings settings("board", true);
    uuid_ = settings.GetString("uuid");
    if (uuid_.empty()) {
        uuid_ = GenerateUuid();
        settings.SetString("uuid", uuid_);
    }
    ESP_LOGI(TAG, "UUID=%s SKU=%s", uuid_.c_str(), BOARD_NAME);
    
    // 确保板级配置已初始化
    InitBoardConfig();
}

void Board::InitBoardConfig() {
    if (config_initialized_) {
        return;
    }
    
    ESP_LOGI(TAG, "Initializing board configuration");
    
    static int servo_pins_array[8] = {-1, -1, -1, -1, -1, -1, -1, -1}; // 最多支持8个舵机
    
    // 初始化舵机引脚数组
    board_config_.servo_pins = servo_pins_array;
    board_config_.servo_count = 0;  // 默认没有舵机
    
    // 尝试根据板子的配置头文件和Kconfig初始化引脚
    // 电机引脚配置 - 从Kconfig中读取
#ifdef CONFIG_ENABLE_MOTOR_CONTROLLER
    // 使用定义的电机引脚常量，确保从Kconfig中正确读取
    #ifdef CONFIG_MOTOR_ENA_PIN
    board_config_.ena_pin = CONFIG_MOTOR_ENA_PIN;
    ESP_LOGI(TAG, "Motor ENA pin from Kconfig: %d", CONFIG_MOTOR_ENA_PIN);
    #else
    board_config_.ena_pin = MOTOR_ENA_PIN; // 使用Kconfig定义的默认值
    ESP_LOGI(TAG, "Motor ENA pin using default from board.h: %d", MOTOR_ENA_PIN);
    #endif
    
    #ifdef CONFIG_MOTOR_ENB_PIN
    board_config_.enb_pin = CONFIG_MOTOR_ENB_PIN;
    ESP_LOGI(TAG, "Motor ENB pin from Kconfig: %d", CONFIG_MOTOR_ENB_PIN);
    #else
    board_config_.enb_pin = MOTOR_ENB_PIN; // 使用Kconfig定义的默认值
    ESP_LOGI(TAG, "Motor ENB pin using default from board.h: %d", MOTOR_ENB_PIN);
    #endif
    
    // 根据电机连接方式选择IN1-IN4引脚
    #ifdef CONFIG_MOTOR_CONNECTION_DIRECT
        // 直接连接方式：从CONFIG_MOTOR_INx_PIN获取引脚
        #ifdef CONFIG_MOTOR_IN1_PIN
        board_config_.in1_pin = CONFIG_MOTOR_IN1_PIN;
        ESP_LOGI(TAG, "Motor IN1 pin from Kconfig (direct): %d", CONFIG_MOTOR_IN1_PIN);
        #else
        board_config_.in1_pin = MOTOR_IN1_PIN; // 使用board.h默认值
        ESP_LOGI(TAG, "Motor IN1 pin using default from board.h: %d", MOTOR_IN1_PIN);
        #endif
        
        #ifdef CONFIG_MOTOR_IN2_PIN
        board_config_.in2_pin = CONFIG_MOTOR_IN2_PIN;
        ESP_LOGI(TAG, "Motor IN2 pin from Kconfig (direct): %d", CONFIG_MOTOR_IN2_PIN);
        #else
        board_config_.in2_pin = MOTOR_IN2_PIN; // 使用board.h默认值
        ESP_LOGI(TAG, "Motor IN2 pin using default from board.h: %d", MOTOR_IN2_PIN);
        #endif
        
        #ifdef CONFIG_MOTOR_IN3_PIN
        board_config_.in3_pin = CONFIG_MOTOR_IN3_PIN;
        ESP_LOGI(TAG, "Motor IN3 pin from Kconfig (direct): %d", CONFIG_MOTOR_IN3_PIN);
        #else
        board_config_.in3_pin = MOTOR_IN3_PIN; // 使用board.h默认值
        ESP_LOGI(TAG, "Motor IN3 pin using default from board.h: %d", MOTOR_IN3_PIN);
        #endif
        
        #ifdef CONFIG_MOTOR_IN4_PIN
        board_config_.in4_pin = CONFIG_MOTOR_IN4_PIN;
        ESP_LOGI(TAG, "Motor IN4 pin from Kconfig (direct): %d", CONFIG_MOTOR_IN4_PIN);
        #else
        board_config_.in4_pin = MOTOR_IN4_PIN; // 使用board.h默认值
        ESP_LOGI(TAG, "Motor IN4 pin using default from board.h: %d", MOTOR_IN4_PIN);
        #endif
    #elif defined(CONFIG_MOTOR_CONNECTION_PCF8575)
        // PCF8575连接方式：电机控制引脚通过PCF8575多路复用器连接
        // 这种情况下，实际引脚编号由PCF8575控制器确定，我们在这里使用-1表示通过多路复用器控制
        board_config_.in1_pin = -1;
        board_config_.in2_pin = -1;
        board_config_.in3_pin = -1;
        board_config_.in4_pin = -1;
        ESP_LOGI(TAG, "Motor control pins using PCF8575 multiplexer");
        #ifdef CONFIG_MOTOR_PCF8575_IN1_PIN
        ESP_LOGI(TAG, "PCF8575 Motor IN1 pin: %d", CONFIG_MOTOR_PCF8575_IN1_PIN);
        #endif
        #ifdef CONFIG_MOTOR_PCF8575_IN2_PIN
        ESP_LOGI(TAG, "PCF8575 Motor IN2 pin: %d", CONFIG_MOTOR_PCF8575_IN2_PIN);
        #endif
        #ifdef CONFIG_MOTOR_PCF8575_IN3_PIN
        ESP_LOGI(TAG, "PCF8575 Motor IN3 pin: %d", CONFIG_MOTOR_PCF8575_IN3_PIN);
        #endif
        #ifdef CONFIG_MOTOR_PCF8575_IN4_PIN
        ESP_LOGI(TAG, "PCF8575 Motor IN4 pin: %d", CONFIG_MOTOR_PCF8575_IN4_PIN);
        #endif
    #else
        // 默认情况
        board_config_.in1_pin = MOTOR_IN1_PIN;
        board_config_.in2_pin = MOTOR_IN2_PIN;
        board_config_.in3_pin = MOTOR_IN3_PIN;
        board_config_.in4_pin = MOTOR_IN4_PIN;
        ESP_LOGI(TAG, "Motor pins using defaults: IN1=%d, IN2=%d, IN3=%d, IN4=%d", 
                 board_config_.in1_pin, board_config_.in2_pin, board_config_.in3_pin, board_config_.in4_pin);
    #endif
    
    // 检查是否有引脚冲突
    if (board_config_.ena_pin == board_config_.in1_pin || 
        board_config_.ena_pin == board_config_.in2_pin || 
        board_config_.ena_pin == board_config_.in3_pin || 
        board_config_.ena_pin == board_config_.in4_pin ||
        board_config_.enb_pin == board_config_.in1_pin || 
        board_config_.enb_pin == board_config_.in2_pin || 
        board_config_.enb_pin == board_config_.in3_pin || 
        board_config_.enb_pin == board_config_.in4_pin) {
        ESP_LOGW(TAG, "Warning: Motor pin conflict detected! Check your configuration");
    }
#else
    // 如果未启用电机控制器，则设置为无效值
    board_config_.ena_pin = -1;
    board_config_.enb_pin = -1;
    board_config_.in1_pin = -1;
    board_config_.in2_pin = -1;
    board_config_.in3_pin = -1;
    board_config_.in4_pin = -1;
    ESP_LOGI(TAG, "Motor controller disabled");
#endif
    
