jfy9606/xiaozhi-esp32/main/boards/common/board.cc
    // 舵机引脚配置 - 从Kconfig中读取
#ifdef CONFIG_ENABLE_SERVO_CONTROLLER
    #ifdef CONFIG_SERVO_CONNECTION_DIRECT
        // 直接连接方式：使用GPIO引脚
        board_config_.servo_count = SERVO_COUNT > 8 ? 8 : SERVO_COUNT; // 限制最多8个舵机
        
        ESP_LOGI(TAG, "Setting up %d servos from Kconfig (direct GPIO connection)", board_config_.servo_count);
        
        // 默认初始化所有引脚为-1（无效值）
        for (int i = 0; i < 8; i++) {
            servo_pins_array[i] = -1;
        }
        
        // 直接使用Kconfig定义的舵机引脚
        #ifdef CONFIG_SERVO_PIN_1
        servo_pins_array[0] = CONFIG_SERVO_PIN_1;
        ESP_LOGI(TAG, "Servo 1 pin from Kconfig: %d", CONFIG_SERVO_PIN_1);
        #elif defined(SERVO_PIN_1)
        servo_pins_array[0] = SERVO_PIN_1;
        ESP_LOGI(TAG, "Servo 1 pin using default from board.h: %d", SERVO_PIN_1);
        #else
        ESP_LOGI(TAG, "Servo 1 pin not defined");
        #endif
        
        #ifdef CONFIG_SERVO_PIN_2
        if (board_config_.servo_count >= 2) {
            servo_pins_array[1] = CONFIG_SERVO_PIN_2;
            ESP_LOGI(TAG, "Servo 2 pin from Kconfig: %d", CONFIG_SERVO_PIN_2);
        }
        #elif defined(SERVO_PIN_2)
        if (board_config_.servo_count >= 2) {
            servo_pins_array[1] = SERVO_PIN_2;
            ESP_LOGI(TAG, "Servo 2 pin using default from board.h: %d", SERVO_PIN_2);
        }
        #else
        ESP_LOGI(TAG, "Servo 2 pin not defined");
        #endif
        
        #ifdef CONFIG_SERVO_PIN_3
        if (board_config_.servo_count >= 3) {
            servo_pins_array[2] = CONFIG_SERVO_PIN_3;
            ESP_LOGI(TAG, "Servo 3 pin from Kconfig: %d", CONFIG_SERVO_PIN_3);
        }
        #elif defined(SERVO_PIN_3)
        if (board_config_.servo_count >= 3) {
            servo_pins_array[2] = SERVO_PIN_3;
            ESP_LOGI(TAG, "Servo 3 pin using default from board.h: %d", SERVO_PIN_3);
        }
        #else
        ESP_LOGI(TAG, "Servo 3 pin not defined");
        #endif
        
        #ifdef CONFIG_SERVO_PIN_4
        if (board_config_.servo_count >= 4) {
            servo_pins_array[3] = CONFIG_SERVO_PIN_4;
            ESP_LOGI(TAG, "Servo 4 pin from Kconfig: %d", CONFIG_SERVO_PIN_4);
        }
        #elif defined(SERVO_PIN_4)
        if (board_config_.servo_count >= 4) {
            servo_pins_array[3] = SERVO_PIN_4;
            ESP_LOGI(TAG, "Servo 4 pin using default from board.h: %d", SERVO_PIN_4);
        }
        #else
        ESP_LOGI(TAG, "Servo 4 pin not defined");
        #endif
        
        #ifdef CONFIG_SERVO_PIN_5
        if (board_config_.servo_count >= 5) {
            servo_pins_array[4] = CONFIG_SERVO_PIN_5;
            ESP_LOGI(TAG, "Servo 5 pin from Kconfig: %d", CONFIG_SERVO_PIN_5);
        }
        #elif defined(SERVO_PIN_5)
        if (board_config_.servo_count >= 5) {
            servo_pins_array[4] = SERVO_PIN_5;
            ESP_LOGI(TAG, "Servo 5 pin using default from board.h: %d", SERVO_PIN_5);
        }
        #else
        ESP_LOGI(TAG, "Servo 5 pin not defined");
        #endif
        
        #ifdef CONFIG_SERVO_PIN_6
        if (board_config_.servo_count >= 6) {
            servo_pins_array[5] = CONFIG_SERVO_PIN_6;
            ESP_LOGI(TAG, "Servo 6 pin from Kconfig: %d", CONFIG_SERVO_PIN_6);
        }
        #elif defined(SERVO_PIN_6)
        if (board_config_.servo_count >= 6) {
            servo_pins_array[5] = SERVO_PIN_6;
            ESP_LOGI(TAG, "Servo 6 pin using default from board.h: %d", SERVO_PIN_6);
        }
        #else
        ESP_LOGI(TAG, "Servo 6 pin not defined");
        #endif
        
        #ifdef CONFIG_SERVO_PIN_7
        if (board_config_.servo_count >= 7) {
            servo_pins_array[6] = CONFIG_SERVO_PIN_7;
            ESP_LOGI(TAG, "Servo 7 pin from Kconfig: %d", CONFIG_SERVO_PIN_7);
        }
        #elif defined(SERVO_PIN_7)
        if (board_config_.servo_count >= 7) {
            servo_pins_array[6] = SERVO_PIN_7;
            ESP_LOGI(TAG, "Servo 7 pin using default from board.h: %d", SERVO_PIN_7);
        }
        #else
        ESP_LOGI(TAG, "Servo 7 pin not defined");
        #endif
        
        #ifdef CONFIG_SERVO_PIN_8
        if (board_config_.servo_count >= 8) {
            servo_pins_array[7] = CONFIG_SERVO_PIN_8;
            ESP_LOGI(TAG, "Servo 8 pin from Kconfig: %d", CONFIG_SERVO_PIN_8);
        }
        #elif defined(SERVO_PIN_8)
        if (board_config_.servo_count >= 8) {
            servo_pins_array[7] = SERVO_PIN_8;
            ESP_LOGI(TAG, "Servo 8 pin using default from board.h: %d", SERVO_PIN_8);
        }
        #else
        ESP_LOGI(TAG, "Servo 8 pin not defined");
        #endif
        
        ESP_LOGI(TAG, "Servo count: %d", board_config_.servo_count);
        for (int i = 0; i < board_config_.servo_count; i++) {
            ESP_LOGI(TAG, "Servo %d pin: %d", i+1, servo_pins_array[i]);
        }
    #elif defined(CONFIG_SERVO_CONNECTION_LU9685)
        // LU9685连接方式：使用LU9685-20CU舵机控制器
        // 这种情况下，舵机通过I2C控制器连接，不使用GPIO引脚
        // 设置舵机数量为4（标准配置为左、右、上、下四个舵机）
        board_config_.servo_count = 4;
        ESP_LOGI(TAG, "Using LU9685 servo controller with %d servos", board_config_.servo_count);
        
        // 标记所有GPIO引脚为无效，因为使用LU9685
        for (int i = 0; i < 8; i++) {
            servo_pins_array[i] = -1;
        }
        
        // 输出LU9685通道配置
        #ifdef CONFIG_SERVO_LU9685_LEFT_CHANNEL
        ESP_LOGI(TAG, "LU9685 Left servo channel: %d", CONFIG_SERVO_LU9685_LEFT_CHANNEL);
        #endif
        
        #ifdef CONFIG_SERVO_LU9685_RIGHT_CHANNEL
        ESP_LOGI(TAG, "LU9685 Right servo channel: %d", CONFIG_SERVO_LU9685_RIGHT_CHANNEL);
        #endif
        
        #ifdef CONFIG_SERVO_LU9685_UP_CHANNEL
        ESP_LOGI(TAG, "LU9685 Up servo channel: %d", CONFIG_SERVO_LU9685_UP_CHANNEL);
        #endif
        
        #ifdef CONFIG_SERVO_LU9685_DOWN_CHANNEL
        ESP_LOGI(TAG, "LU9685 Down servo channel: %d", CONFIG_SERVO_LU9685_DOWN_CHANNEL);
        #endif
    #else
        // 未知连接方式，设置为0舵机
        board_config_.servo_count = 0;
        ESP_LOGW(TAG, "Unknown servo connection type, disabling servos");
    #endif
#else
    board_config_.servo_count = 0;
    ESP_LOGI(TAG, "Servo controller disabled");
#endif
    
